In [2]:
import numpy as np 
import pandas as pd

In [22]:
df = pd.DataFrame({
    "col1": [1,2,3,4],
    "col2": [444,555,666,444], 
    "col3": ["abc", "def","ghi", "jkl"]      
})

NameError: name 'pwd' is not defined

In [4]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  jkl

In [5]:
df["col2"].unique()

array([444, 555, 666])

In [6]:
df["col2"].nunique()

3

In [7]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [8]:
df[df['col2']>444]  # conditional selection

   col1  col2 col3
1     2   555  def
2     3   666  ghi

In [9]:
def times2(x): 
    return x*2

In [10]:
# if you have to apply a custom function on a column we can do that on pandas colum using apply
col = df['col1'].apply(times2)  # alternatively df['col1'].apply(lambda x: x*2)

In [11]:
df['col1'] = col # or you can use col.values
df

   col1  col2 col3
0     2   444  abc
1     4   555  def
2     6   666  ghi
3     8   444  jkl

In [12]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [13]:
# remove the column 
df.drop('col1',axis=1)  # axis is important because if axis=0 or not specified it means row and therefore 
                        # the drop function will fail as there iwll be no row with index value as col1

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  jkl

In [14]:
## Some operatiosn to get column and index 
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [15]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [16]:
# sort the values 
df.sort_values(by='col2')

   col1  col2 col3
0     2   444  abc
3     8   444  jkl
1     4   555  def
2     6   666  ghi

In [17]:
df.isnull()  # this gives boolean df which indicates how many values are null marked by true value.

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

## Pivot Functionality

In [18]:
 data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df1 = pd.DataFrame(data)

In [19]:
df1

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [20]:
df1.pivot_table(values='D', index=['A','B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [23]:
pwd

'/Users/ritesh/Documents/py-projects/py-learn/pandas'